#![allow(uncommon_codepoints)]
#![allow(confusable_idents)]
sanim::sanim! {
    ใช้ มาตรฐาน::การจัดเก็บข้อมูล::แฮชแมพ;
    #[ย่อย(ดีบัก)]
    สาธารณะ แจกแจง เพศ {
        ชาย,
        หญิง,
    }
    #[ย่อย(ดีบัก)]
    สธณ ชุดข้อมูล บุคคล {
        สธณ ชื่อ: สตริง,
        สาธารณะ อายุ: จำนวนเต็ม,
        สาธารณะ เพศ: เพศ,
    }

    ลักษณะ มนุษย์ {
        ฟังก์ชัน เดิน(&ตน) {
            พิมพ์!("กำลังเดิน");
        }
        ฟังก์ชัน พูด(&ตน) {
            พิมพ์!("สวัสดี");
        }
        ฟังก์ชัน เล่น(&ตน);
    }

    วิธี มนุษย์ สำหรับ บุคคล {
        ฟังก์ชัน เล่น(&ตน) {
            พิมพ์!("เล่นเกมส์");
        }
    }



    ฟังก์ชัน หลัก() {
        พิมพ์บรรทัด!("สวัสดี, โลก!");

        ให้ นายเอ = บุคคล {
            ชื่อ: "สมชาย".เป็นสตริง(),
            อายุ: 18,
            เพศ: เพศ::ชาย,
        };

        ให้ นางสาวบี = บุคคล {
            ชื่อ: "สมหญิง".นำเป็น(),
            อายุ: 20,
            เพศ: เพศ::หญิง,
        };

        ให้ แปรผัน แมพ = แฮชแมพ::ใหม่();

        แมพ.แทรก(0, นายเอ);
        แมพ.แทรก(1, นางสาวบี);

        พิมพ์บรรทัด!("แมพ: {:#?}", แมพ);

    }
}
